IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_gpio_ctrl_regs.xml
	<register id="GPCCR" width="32" page="1" offset="0xbe" internal="0" description="GPIO C Lock Commit Register (GPIO64 to 95)">
		<bitfield id="GPIO64" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO65" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO66" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO67" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO68" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO69" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO70" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO71" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO72" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO73" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO74" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO75" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO76" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO77" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO78" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO79" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO80" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO81" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO82" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO83" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO84" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO85" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO86" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO87" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO88" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO89" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO90" description="Configuration lock commit bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO91" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO92" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO93" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO94" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO95" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDCTRL" width="32" page="1" offset="0xc0" internal="0" description="GPIO D Qualification Sampling Period Control (GPIO96 to 127)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO96 to GPIO103" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO104 to GPIO111" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO112 to GPIO119" begin="23" end="16" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD3" description="Qualification sampling period for GPIO120 to GPIO127" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="GPDQSEL1" width="32" page="1" offset="0xc2" internal="0" description="GPIO D Qualifier Select 1 Register (GPIO96 to 111)">
		<bitfield id="GPIO96" description="Select input qualification type for GPIO96" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Select input qualification type for GPIO97" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Select input qualification type for GPIO98" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Select input qualification type for GPIO99" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Select input qualification type for GPIO100" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Select input qualification type for GPIO101" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO102" description="Select input qualification type for GPIO102" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Select input qualification type for GPIO103" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO104" description="Select input qualification type for GPIO104" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Select input qualification type for GPIO105" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO106" description="Select input qualification type for GPIO106" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO107" description="Select input qualification type for GPIO107" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO108" description="Select input qualification type for GPIO108" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO109" description="Select input qualification type for GPIO109" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO110" description="Select input qualification type for GPIO110" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO111" description="Select input qualification type for GPIO111" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
