IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_gpio_ctrl_regs.xml
	<register id="GPDGMUX2" width="32" page="1" offset="0xe2" internal="0" description="GPIO D Peripheral Group Mux (GPIO112 to 127)">
		<bitfield id="GPIO112" description="Defines pin-muxing selection for GPIO112" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO113" description="Defines pin-muxing selection for GPIO113" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO114" description="Defines pin-muxing selection for GPIO114" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO115" description="Defines pin-muxing selection for GPIO115" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO116" description="Defines pin-muxing selection for GPIO116" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO119" description="Defines pin-muxing selection for GPIO119" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO120" description="Defines pin-muxing selection for GPIO120" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO122" description="Defines pin-muxing selection for GPIO122" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO123" description="Defines pin-muxing selection for GPIO123" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO124" description="Defines pin-muxing selection for GPIO124" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO125" description="Defines pin-muxing selection for GPIO125" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO126" description="Defines pin-muxing selection for GPIO126" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Defines pin-muxing selection for GPIO127" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPDCSEL1" width="32" page="1" offset="0xe8" internal="0" description="GPIO D Core Select Register (GPIO96 to 103)">
		<bitfield id="GPIO96" description="GPIO96 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO97" description="GPIO97 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO98" description="GPIO98 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO99" description="GPIO99 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO100" description="GPIO100 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO101" description="GPIO101 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO102" description="GPIO102 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO103" description="GPIO103 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPDCSEL2" width="32" page="1" offset="0xea" internal="0" description="GPIO D Core Select Register (GPIO104 to 111)">
		<bitfield id="GPIO104" description="GPIO104 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO105" description="GPIO105 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO106" description="GPIO106 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO107" description="GPIO107 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO108" description="GPIO108 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO109" description="GPIO109 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO110" description="GPIO110 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO111" description="GPIO111 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPDCSEL3" width="32" page="1" offset="0xec" internal="0" description="GPIO D Core Select Register (GPIO112 to 119)">
		<bitfield id="GPIO112" description="GPIO112 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO113" description="GPIO113 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO114" description="GPIO114 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO115" description="GPIO115 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO116" description="GPIO116 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO119" description="GPIO119 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPDCSEL4" width="32" page="1" offset="0xee" internal="0" description="GPIO D Core Select Register (GPIO120 to 127)">
		<bitfield id="GPIO120" description="GPIO120 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO122" description="GPIO122 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO123" description="GPIO123 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO124" description="GPIO124 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO125" description="GPIO125 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO126" description="GPIO126 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO127" description="GPIO127 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPDLOCK" width="32" page="1" offset="0xfc" internal="0" description="GPIO D Lock Configuration Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO102" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO104" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO106" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO107" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO108" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO109" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO110" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO111" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO112" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO113" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO114" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO115" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO116" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO119" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO120" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO122" description="Configuration Lock bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO123" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO124" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO125" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO126" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPDCR" width="32" page="1" offset="0xfe" internal="0" description="GPIO D Lock Commit Register (GPIO96 to 127)">
		<bitfield id="GPIO96" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO97" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO98" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO99" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO100" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO101" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO102" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO103" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO104" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO105" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO106" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO107" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO108" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO109" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO110" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO111" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO112" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO113" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO114" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO115" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO116" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO119" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO120" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO122" description="Configuration lock commit bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO123" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO124" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO125" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO126" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO127" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
