IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_gpio_ctrl_regs.xml
	<register id="GPEGMUX2" width="32" page="1" offset="0x122" internal="0" description="GPIO E Peripheral Group Mux (GPIO144  to 159)">
		<bitfield id="GPIO145" description="Defines pin-muxing selection for GPIO145" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO146" description="Defines pin-muxing selection for GPIO146" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO147" description="Defines pin-muxing selection for GPIO147" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO148" description="Defines pin-muxing selection for GPIO148" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO149" description="Defines pin-muxing selection for GPIO149" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO150" description="Defines pin-muxing selection for GPIO150" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO151" description="Defines pin-muxing selection for GPIO151" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO152" description="Defines pin-muxing selection for GPIO152" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO153" description="Defines pin-muxing selection for GPIO153" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO154" description="Defines pin-muxing selection for GPIO154" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO155" description="Defines pin-muxing selection for GPIO155" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO156" description="Defines pin-muxing selection for GPIO156" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO157" description="Defines pin-muxing selection for GPIO157" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO158" description="Defines pin-muxing selection for GPIO158" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO159" description="Defines pin-muxing selection for GPIO159" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPECSEL1" width="32" page="1" offset="0x128" internal="0" description="GPIO E Core Select Register (GPIO128 to 135)">
		<bitfield id="GPIO128" description="GPIO128 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO129" description="GPIO129 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO130" description="GPIO130 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO131" description="GPIO131 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO132" description="GPIO132 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO133" description="GPIO133 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO134" description="GPIO134 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
	</register>
	<register id="GPECSEL2" width="32" page="1" offset="0x12a" internal="0" description="GPIO E Core Select Register (GPIO136 to 143)">
		<bitfield id="GPIO141" description="GPIO141 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO142" description="GPIO142 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
	</register>
	<register id="GPECSEL3" width="32" page="1" offset="0x12c" internal="0" description="GPIO E Core Select Register (GPIO144  to 151)">
		<bitfield id="GPIO145" description="GPIO145 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO146" description="GPIO146 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO147" description="GPIO147 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO148" description="GPIO148 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO149" description="GPIO149 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO150" description="GPIO150 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO151" description="GPIO151 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPECSEL4" width="32" page="1" offset="0x12e" internal="0" description="GPIO E Core Select Register (GPIO152 to 159)">
		<bitfield id="GPIO152" description="GPIO152 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO153" description="GPIO153 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO154" description="GPIO154 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO155" description="GPIO155 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO156" description="GPIO156 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO157" description="GPIO157 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO158" description="GPIO158 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO159" description="GPIO159 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPELOCK" width="32" page="1" offset="0x13c" internal="0" description="GPIO E Lock Configuration Register (GPIO128 to 159)">
		<bitfield id="GPIO128" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO129" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO130" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO131" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO132" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO133" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO134" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO141" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO142" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO145" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO146" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO147" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO148" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO149" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO150" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO151" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO152" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO153" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO154" description="Configuration Lock bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO155" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO156" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO157" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO158" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO159" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPECR" width="32" page="1" offset="0x13e" internal="0" description="GPIO E Lock Commit Register (GPIO128 to 159)">
		<bitfield id="GPIO128" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO129" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO130" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO131" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO132" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO133" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO134" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO141" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO142" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO145" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO146" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO147" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO148" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO149" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO150" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO151" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO152" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO153" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO154" description="Configuration lock commit bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO155" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO156" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO157" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO158" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO159" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFCTRL" width="32" page="1" offset="0x140" internal="0" description="GPIO F Qualification Sampling Period Control (GPIO160 to 191)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO160 to GPIO167" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO168" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="GPFQSEL1" width="32" page="1" offset="0x142" internal="0" description="GPIO F Qualifier Select 1 Register (GPIO160 to 168)">
		<bitfield id="GPIO160" description="Select input qualification type for GPIO160" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Select input qualification type for GPIO161" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Select input qualification type for GPIO162" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Select input qualification type for GPIO163" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Select input qualification type for GPIO164" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Select input qualification type for GPIO165" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Select input qualification type for GPIO166" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Select input qualification type for GPIO167" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Select input qualification type for GPIO168" begin="17" end="16" width="2" rwaccess="RW"/>
	</register>
	<register id="GPFQSEL2" width="32" page="1" offset="0x144" internal="0" description="GPIO F Qualifier Select 2 Register (GPIO176 to 191)">
	</register>
