IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_gpio_ctrl_regs.xml
	<register id="GPFCSEL2" width="32" page="1" offset="0x16a" internal="0" description="GPIO F Core Select Register (GPIO168 to 175)">
		<bitfield id="GPIO168" description="GPIO168 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
	</register>
	<register id="GPFCSEL3" width="32" page="1" offset="0x16c" internal="0" description="GPIO F Core Select Register (GPIO176 to 183)">
	</register>
	<register id="GPFCSEL4" width="32" page="1" offset="0x16e" internal="0" description="GPIO F Core Select Register (GPIO184 to 191)">
	</register>
	<register id="GPFLOCK" width="32" page="1" offset="0x17c" internal="0" description="GPIO F Lock Configuration Register (GPIO160 to 191)">
		<bitfield id="GPIO160" description="Configuration Lock bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Configuration Lock bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Configuration Lock bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Configuration Lock bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Configuration Lock bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Configuration Lock bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="GPFCR" width="32" page="1" offset="0x17e" internal="0" description="GPIO F Lock Commit Register (GPIO160 to 191)">
		<bitfield id="GPIO160" description="Configuration lock commit bit for this pin" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO161" description="Configuration lock commit bit for this pin" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO162" description="Configuration lock commit bit for this pin" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO163" description="Configuration lock commit bit for this pin" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO164" description="Configuration lock commit bit for this pin" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO165" description="Configuration lock commit bit for this pin" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO166" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO167" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO168" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGCTRL" width="32" page="1" offset="0x180" internal="0" description="GPIO G Qualification Sampling Period Control (GPIO192 to 223)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO160 to GPIO167" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO168" begin="15" end="8" width="8" rwaccess="RW"/>
	</register>
	<register id="GPGQSEL1" width="32" page="1" offset="0x182" internal="0" description="GPIO G Qualifier Select 1 Register (GPIO192 to 207)">
		<bitfield id="GPIO198" description="Select input qualification type for GPIO198" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Select input qualification type for GPIO199" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Select input qualification type for GPIO200" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Select input qualification type for GPIO201" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Select input qualification type for GPIO202" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Select input qualification type for GPIO203" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Select input qualification type for GPIO204" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Select input qualification type for GPIO205" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Select input qualification type for GPIO206" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Select input qualification type for GPIO207" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGQSEL2" width="32" page="1" offset="0x184" internal="0" description="GPIO G Qualifier Select 2 Register (GPIO208 to 223)">
		<bitfield id="GPIO208" description="Select input qualification type for GPIO208" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Select input qualification type for GPIO209" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Select input qualification type for GPIO210" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Select input qualification type for GPIO211" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Select input qualification type for GPIO212" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Select input qualification type for GPIO213" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Select input qualification type for GPIO214" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Select input qualification type for GPIO215" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Select input qualification type for GPIO216" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Select input qualification type for GPIO217" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Select input qualification type for GPIO218" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Select input qualification type for GPIO219" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Select input qualification type for GPIO220" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Select input qualification type for GPIO221" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Select input qualification type for GPIO222" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Select input qualification type for GPIO223" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGMUX1" width="32" page="1" offset="0x186" internal="0" description="GPIO G Mux 1 Register (GPIO192 to 207)">
		<bitfield id="GPIO198" description="Defines pin-muxing selection for GPIO198" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Defines pin-muxing selection for GPIO199" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Defines pin-muxing selection for GPIO200" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Defines pin-muxing selection for GPIO201" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Defines pin-muxing selection for GPIO202" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Defines pin-muxing selection for GPIO203" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Defines pin-muxing selection for GPIO204" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Defines pin-muxing selection for GPIO205" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Defines pin-muxing selection for GPIO206" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Defines pin-muxing selection for GPIO207" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGMUX2" width="32" page="1" offset="0x188" internal="0" description="GPIO G Mux 2 Register (GPIO208 to 223)">
		<bitfield id="GPIO208" description="Defines pin-muxing selection for GPIO208" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Defines pin-muxing selection for GPIO209" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Defines pin-muxing selection for GPIO210" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Defines pin-muxing selection for GPIO211" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Defines pin-muxing selection for GPIO212" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Defines pin-muxing selection for GPIO213" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Defines pin-muxing selection for GPIO214" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Defines pin-muxing selection for GPIO215" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Defines pin-muxing selection for GPIO216" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Defines pin-muxing selection for GPIO217" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Defines pin-muxing selection for GPIO218" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Defines pin-muxing selection for GPIO219" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Defines pin-muxing selection for GPIO220" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Defines pin-muxing selection for GPIO221" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Defines pin-muxing selection for GPIO222" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Defines pin-muxing selection for GPIO223" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGDIR" width="32" page="1" offset="0x18a" internal="0" description="GPIO G Direction Register (GPIO192 to 223)">
		<bitfield id="GPIO198" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Defines direction for this pin in GPIO mode" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Defines direction for this pin in GPIO mode" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Defines direction for this pin in GPIO mode" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Defines direction for this pin in GPIO mode" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Defines direction for this pin in GPIO mode" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Defines direction for this pin in GPIO mode" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Defines direction for this pin in GPIO mode" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Defines direction for this pin in GPIO mode" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Defines direction for this pin in GPIO mode" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Defines direction for this pin in GPIO mode" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Defines direction for this pin in GPIO mode" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Defines direction for this pin in GPIO mode" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Defines direction for this pin in GPIO mode" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGPUD" width="32" page="1" offset="0x18c" internal="0" description="GPIO G Pull Up Disable Register (GPIO192 to 223) ">
		<bitfield id="GPIO198" description="Pull-Up Disable control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Pull-Up Disable control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Pull-Up Disable control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Pull-Up Disable control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Pull-Up Disable control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Pull-Up Disable control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Pull-Up Disable control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Pull-Up Disable control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Pull-Up Disable control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Pull-Up Disable control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Pull-Up Disable control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Pull-Up Disable control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Pull-Up Disable control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Pull-Up Disable control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Pull-Up Disable control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Pull-Up Disable control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Pull-Up Disable control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Pull-Up Disable control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Pull-Up Disable control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Pull-Up Disable control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Pull-Up Disable control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Pull-Up Disable control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Pull-Up Disable control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Pull-Up Disable control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Pull-Up Disable control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Pull-Up Disable control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
