IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_gpio_ctrl_regs.xml
	<register id="GPGINV" width="32" page="1" offset="0x190" internal="0" description="GPIO G Input Polarity Invert Registers (GPIO192 to 223)">
		<bitfield id="GPIO198" description="Input inversion control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Input inversion control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Input inversion control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Input inversion control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Input inversion control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Input inversion control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Input inversion control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Input inversion control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Input inversion control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Input inversion control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Input inversion control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Input inversion control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Input inversion control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Input inversion control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Input inversion control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Input inversion control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Input inversion control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Input inversion control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Input inversion control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Input inversion control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Input inversion control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Input inversion control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Input inversion control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Input inversion control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Input inversion control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Input inversion control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGODR" width="32" page="1" offset="0x192" internal="0" description="GPIO G Open Drain Output Register (GPIO192 to 223)">
		<bitfield id="GPIO198" description="Output Open-Drain control for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Output Open-Drain control for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Output Open-Drain control for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Output Open-Drain control for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Output Open-Drain control for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Output Open-Drain control for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Output Open-Drain control for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Output Open-Drain control for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Output Open-Drain control for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Output Open-Drain control for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Output Open-Drain control for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Output Open-Drain control for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Output Open-Drain control for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Output Open-Drain control for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Output Open-Drain control for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Output Open-Drain control for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Output Open-Drain control for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Output Open-Drain control for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Output Open-Drain control for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Output Open-Drain control for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Output Open-Drain control for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Output Open-Drain control for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Output Open-Drain control for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Output Open-Drain control for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Output Open-Drain control for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Output Open-Drain control for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGAMSEL" width="32" page="1" offset="0x194" internal="0" description="GPIO G Analog Mode Select register (GPIO192 to 223)">
		<bitfield id="GPIO198" description="Analog Mode select for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Analog Mode select for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Analog Mode select for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Analog Mode select for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Analog Mode select for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Analog Mode select for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Analog Mode select for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Analog Mode select for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Analog Mode select for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Analog Mode select for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Analog Mode select for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Analog Mode select for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Analog Mode select for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Analog Mode select for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Analog Mode select for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Analog Mode select for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Analog Mode select for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Analog Mode select for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Analog Mode select for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Analog Mode select for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Analog Mode select for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Analog Mode select for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Analog Mode select for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Analog Mode select for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Analog Mode select for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Analog Mode select for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
