IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f28p65x_gpio_ctrl_regs.xml
	<register id="GPGGMUX1" width="32" page="1" offset="0x1a0" internal="0" description="GPIO G Peripheral Group Mux (GPIO192 to 207)">
		<bitfield id="GPIO198" description="Defines pin-muxing selection for GPIO198" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Defines pin-muxing selection for GPIO199" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Defines pin-muxing selection for GPIO200" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Defines pin-muxing selection for GPIO201" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Defines pin-muxing selection for GPIO202" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Defines pin-muxing selection for GPIO203" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Defines pin-muxing selection for GPIO204" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Defines pin-muxing selection for GPIO205" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Defines pin-muxing selection for GPIO206" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Defines pin-muxing selection for GPIO207" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGGMUX2" width="32" page="1" offset="0x1a2" internal="0" description="GPIO G Peripheral Group Mux (GPIO208 to 223)">
		<bitfield id="GPIO208" description="Defines pin-muxing selection for GPIO208" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Defines pin-muxing selection for GPIO209" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Defines pin-muxing selection for GPIO210" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Defines pin-muxing selection for GPIO211" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Defines pin-muxing selection for GPIO212" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Defines pin-muxing selection for GPIO213" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Defines pin-muxing selection for GPIO214" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Defines pin-muxing selection for GPIO215" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Defines pin-muxing selection for GPIO216" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Defines pin-muxing selection for GPIO217" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Defines pin-muxing selection for GPIO218" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Defines pin-muxing selection for GPIO219" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Defines pin-muxing selection for GPIO220" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Defines pin-muxing selection for GPIO221" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Defines pin-muxing selection for GPIO222" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Defines pin-muxing selection for GPIO223" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPGCSEL1" width="32" page="1" offset="0x1a8" internal="0" description="GPIO G Core Select Register (GPIO192 to 199)">
		<bitfield id="GPIO198" description="GPIO198 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO199" description="GPIO199 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPGCSEL2" width="32" page="1" offset="0x1aa" internal="0" description="GPIO G Core Select Register (GPIO200 to 207)">
		<bitfield id="GPIO200" description="GPIO200 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO201" description="GPIO201 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO202" description="GPIO202 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO203" description="GPIO203 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO204" description="GPIO204 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO205" description="GPIO205 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO206" description="GPIO206 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO207" description="GPIO207 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPGCSEL3" width="32" page="1" offset="0x1ac" internal="0" description="GPIO G Core Select Register (GPIO208 to 215)">
		<bitfield id="GPIO208" description="GPIO208 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO209" description="GPIO209 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO210" description="GPIO210 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO211" description="GPIO211 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO212" description="GPIO212 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO213" description="GPIO213 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO214" description="GPIO214 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO215" description="GPIO215 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPGCSEL4" width="32" page="1" offset="0x1ae" internal="0" description="GPIO G Core Select Register (GPIO216 to 223)">
		<bitfield id="GPIO216" description="GPIO216 Controller CPU Select" begin="3" end="0" width="4" rwaccess="RW"/>
		<bitfield id="GPIO217" description="GPIO217 Controller CPU Select" begin="7" end="4" width="4" rwaccess="RW"/>
		<bitfield id="GPIO218" description="GPIO218 Controller CPU Select" begin="11" end="8" width="4" rwaccess="RW"/>
		<bitfield id="GPIO219" description="GPIO219 Controller CPU Select" begin="15" end="12" width="4" rwaccess="RW"/>
		<bitfield id="GPIO220" description="GPIO220 Controller CPU Select" begin="19" end="16" width="4" rwaccess="RW"/>
		<bitfield id="GPIO221" description="GPIO221 Controller CPU Select" begin="23" end="20" width="4" rwaccess="RW"/>
		<bitfield id="GPIO222" description="GPIO222 Controller CPU Select" begin="27" end="24" width="4" rwaccess="RW"/>
		<bitfield id="GPIO223" description="GPIO223 Controller CPU Select" begin="31" end="28" width="4" rwaccess="RW"/>
	</register>
	<register id="GPGLOCK" width="32" page="1" offset="0x1bc" internal="0" description="GPIO G Lock Configuration Register (GPIO192 to 223)">
		<bitfield id="GPIO198" description="Configuration Lock bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Configuration Lock bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Configuration Lock bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Configuration Lock bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Configuration Lock bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Configuration Lock bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Configuration Lock bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Configuration Lock bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Configuration Lock bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Configuration Lock bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Configuration Lock bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Configuration Lock bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Configuration Lock bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Configuration Lock bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Configuration Lock bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Configuration Lock bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Configuration Lock bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Configuration Lock bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Configuration Lock bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Configuration Lock bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Configuration Lock bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Configuration Lock bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Configuration Lock bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Configuration Lock bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Configuration Lock bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Configuration Lock bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPGCR" width="32" page="1" offset="0x1be" internal="0" description="GPIO G Lock Commit Register (GPIO192 to 223)">
		<bitfield id="GPIO198" description="Configuration lock commit bit for this pin" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO199" description="Configuration lock commit bit for this pin" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO200" description="Configuration lock commit bit for this pin" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO201" description="Configuration lock commit bit for this pin" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO202" description="Configuration lock commit bit for this pin" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO203" description="Configuration lock commit bit for this pin" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO204" description="Configuration lock commit bit for this pin" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO205" description="Configuration lock commit bit for this pin" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO206" description="Configuration lock commit bit for this pin" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO207" description="Configuration lock commit bit for this pin" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO208" description="Configuration lock commit bit for this pin" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO209" description="Configuration lock commit bit for this pin" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO210" description="Configuration lock commit bit for this pin" begin="18" end="18" width="1" rwaccess="RW"/>
		<bitfield id="GPIO211" description="Configuration lock commit bit for this pin" begin="19" end="19" width="1" rwaccess="RW"/>
		<bitfield id="GPIO212" description="Configuration lock commit bit for this pin" begin="20" end="20" width="1" rwaccess="RW"/>
		<bitfield id="GPIO213" description="Configuration lock commit bit for this pin" begin="21" end="21" width="1" rwaccess="RW"/>
		<bitfield id="GPIO214" description="Configuration lock commit bit for this pin" begin="22" end="22" width="1" rwaccess="RW"/>
		<bitfield id="GPIO215" description="Configuration lock commit bit for this pin" begin="23" end="23" width="1" rwaccess="RW"/>
		<bitfield id="GPIO216" description="Configuration lock commit bit for this pin" begin="24" end="24" width="1" rwaccess="RW"/>
		<bitfield id="GPIO217" description="Configuration lock commit bit for this pin" begin="25" end="25" width="1" rwaccess="RW"/>
		<bitfield id="GPIO218" description="Configuration lock commit bit for this pin" begin="26" end="26" width="1" rwaccess="RW"/>
		<bitfield id="GPIO219" description="Configuration lock commit bit for this pin" begin="27" end="27" width="1" rwaccess="RW"/>
		<bitfield id="GPIO220" description="Configuration lock commit bit for this pin" begin="28" end="28" width="1" rwaccess="RW"/>
		<bitfield id="GPIO221" description="Configuration lock commit bit for this pin" begin="29" end="29" width="1" rwaccess="RW"/>
		<bitfield id="GPIO222" description="Configuration lock commit bit for this pin" begin="30" end="30" width="1" rwaccess="RW"/>
		<bitfield id="GPIO223" description="Configuration lock commit bit for this pin" begin="31" end="31" width="1" rwaccess="RW"/>
	</register>
	<register id="GPHCTRL" width="32" page="1" offset="0x1c0" internal="0" description="GPIO H Qualification Sampling Period Control (GPIO224 to 255)">
		<bitfield id="QUALPRD0" description="Qualification sampling period for GPIO224 to GPIO231" begin="7" end="0" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD1" description="Qualification sampling period for GPIO232 to GPIO239" begin="15" end="8" width="8" rwaccess="RW"/>
		<bitfield id="QUALPRD2" description="Qualification sampling period for GPIO240 to GPIO247" begin="23" end="16" width="8" rwaccess="RW"/>
	</register>
	<register id="GPHQSEL1" width="32" page="1" offset="0x1c2" internal="0" description="GPIO H Qualifier Select 1 Register (GPIO224 to 239)">
		<bitfield id="GPIO224" description="Select input qualification type for this GPIO Pin" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Select input qualification type for this GPIO Pin" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Select input qualification type for this GPIO Pin" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Select input qualification type for this GPIO Pin" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Select input qualification type for this GPIO Pin" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Select input qualification type for this GPIO Pin" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Select input qualification type for this GPIO Pin" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Select input qualification type for this GPIO Pin" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Select input qualification type for this GPIO Pin" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Select input qualification type for this GPIO Pin" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Select input qualification type for this GPIO Pin" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Select input qualification type for this GPIO Pin" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Select input qualification type for this GPIO Pin" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Select input qualification type for this GPIO Pin" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Select input qualification type for this GPIO Pin" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Select input qualification type for this GPIO Pin" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHQSEL2" width="32" page="1" offset="0x1c4" internal="0" description="GPIO H Qualifier Select 2 Register (GPIO240 to 255)">
		<bitfield id="GPIO240" description="Select input qualification type for this GPIO Pin" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Select input qualification type for this GPIO Pin" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Select input qualification type for this GPIO Pin" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHMUX1" width="32" page="1" offset="0x1c6" internal="0" description="GPIO H Mux 1 Register (GPIO224 to 239)">
		<bitfield id="GPIO224" description="Defines pin-muxing selection for GPIO224" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Defines pin-muxing selection for GPIO225" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Defines pin-muxing selection for GPIO226" begin="5" end="4" width="2" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Defines pin-muxing selection for GPIO227" begin="7" end="6" width="2" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Defines pin-muxing selection for GPIO228" begin="9" end="8" width="2" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Defines pin-muxing selection for GPIO229" begin="11" end="10" width="2" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Defines pin-muxing selection for GPIO230" begin="13" end="12" width="2" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Defines pin-muxing selection for GPIO231" begin="15" end="14" width="2" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Defines pin-muxing selection for GPIO232" begin="17" end="16" width="2" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Defines pin-muxing selection for GPIO233" begin="19" end="18" width="2" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Defines pin-muxing selection for GPIO234" begin="21" end="20" width="2" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Defines pin-muxing selection for GPIO235" begin="23" end="22" width="2" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Defines pin-muxing selection for GPIO236" begin="25" end="24" width="2" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Defines pin-muxing selection for GPIO237" begin="27" end="26" width="2" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Defines pin-muxing selection for GPIO238" begin="29" end="28" width="2" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Defines pin-muxing selection for GPIO239" begin="31" end="30" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHMUX2" width="32" page="1" offset="0x1c8" internal="0" description="GPIO H Mux 2 Register (GPIO240 to 255)">
		<bitfield id="GPIO240" description="Defines pin-muxing selection for GPIO240" begin="1" end="0" width="2" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Defines pin-muxing selection for GPIO241" begin="3" end="2" width="2" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Defines pin-muxing selection for GPIO242" begin="5" end="4" width="2" rwaccess="RW"/>
	</register>
	<register id="GPHDIR" width="32" page="1" offset="0x1ca" internal="0" description="GPIO H Direction Register (GPIO224 to 255)">
		<bitfield id="GPIO224" description="Defines direction for this pin in GPIO mode" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="GPIO225" description="Defines direction for this pin in GPIO mode" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="GPIO226" description="Defines direction for this pin in GPIO mode" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="GPIO227" description="Defines direction for this pin in GPIO mode" begin="3" end="3" width="1" rwaccess="RW"/>
		<bitfield id="GPIO228" description="Defines direction for this pin in GPIO mode" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="GPIO229" description="Defines direction for this pin in GPIO mode" begin="5" end="5" width="1" rwaccess="RW"/>
		<bitfield id="GPIO230" description="Defines direction for this pin in GPIO mode" begin="6" end="6" width="1" rwaccess="RW"/>
		<bitfield id="GPIO231" description="Defines direction for this pin in GPIO mode" begin="7" end="7" width="1" rwaccess="RW"/>
		<bitfield id="GPIO232" description="Defines direction for this pin in GPIO mode" begin="8" end="8" width="1" rwaccess="RW"/>
		<bitfield id="GPIO233" description="Defines direction for this pin in GPIO mode" begin="9" end="9" width="1" rwaccess="RW"/>
		<bitfield id="GPIO234" description="Defines direction for this pin in GPIO mode" begin="10" end="10" width="1" rwaccess="RW"/>
		<bitfield id="GPIO235" description="Defines direction for this pin in GPIO mode" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="GPIO236" description="Defines direction for this pin in GPIO mode" begin="12" end="12" width="1" rwaccess="RW"/>
		<bitfield id="GPIO237" description="Defines direction for this pin in GPIO mode" begin="13" end="13" width="1" rwaccess="RW"/>
		<bitfield id="GPIO238" description="Defines direction for this pin in GPIO mode" begin="14" end="14" width="1" rwaccess="RW"/>
		<bitfield id="GPIO239" description="Defines direction for this pin in GPIO mode" begin="15" end="15" width="1" rwaccess="RW"/>
		<bitfield id="GPIO240" description="Defines direction for this pin in GPIO mode" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="GPIO241" description="Defines direction for this pin in GPIO mode" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="GPIO242" description="Defines direction for this pin in GPIO mode" begin="18" end="18" width="1" rwaccess="RW"/>
	</register>
